# ElementCategoryChangeInvalidatesMultiReferenceAnnotation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MultiReferenceAnnotationFailures..::..ElementCategoryChangeInvalidatesMultiReferenceAnnotation Property
BuiltInFailures..::..MultiReferenceAnnotationFailures Class See Also
---
Elements have changed category. Multi-rebar annotations for these elements are now of the wrong category and will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementCategoryChangeInvalidatesMultiReferenceAnnotation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementCategoryChangeInvalidatesMultiReferenceAnnotation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementCategoryChangeInvalidatesMultiReferenceAnnotation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MultiReferenceAnnotationFailures Class
Autodesk.Revit.DB Namespace